---
tags:
  - Лабораторная_работа
Тема: 1.2 Управляющие инструкции
Количество часов: 2
Номер занятия: 3
Состояние: Нужно усовершенствовать 
---

# Лабораторная работа № 3  
Разработка программ с использованием управляющих инструкций

## Цель и задачи

1. Научиться использовать условные операторы (`if`, `elif`, `else`) для принятия решений в программе.  
2. Освоить работу с циклическими конструкциями (`for`, `while`) и управляющими инструкциями цикла (`break`, `continue`).  
3. Разработать простые программы, демонстрирующие сочетание условий и циклов, и провести их тестирование.  
4. Оформить отчёт, в котором отражены результаты экспериментов и выводы по выполненной работе.

## Теоретическая часть

| Понятие | Определение | Пример/формула |
|---------|-------------|----------------|
| Условный оператор `if` | Позволяет выполнить блок кода, если условие истинно. | `if x > 0: print('Positive')` |
| `elif` | Дополнительное условие, проверяемое, если предыдущее условие ложно. | `elif x == 0: print('Zero')` |
| `else` | Блок кода, выполняемый, если все предыдущие условия ложны. | `else: print('Negative')` |
| Оператор `for` | Итерация по последовательности (список, диапазон). | `for i in range(5): print(i)` |
| Оператор `while` | Повторение блока, пока условие истинно. | `while x < 10: x += 1` |
| `break` | Прерывает цикл полностью. | `break` внутри цикла `for` или `while` |
| `continue` | Пропускает оставшуюся часть текущей итерации и переходит к следующей. | `continue` внутри цикла |
| Логический оператор `and` | Возвращает `True`, если оба операнда истинны. | `a and b` |
| Логический оператор `or` | Возвращает `True`, если хотя бы один операнд истинен. | `a or b` |
| Логический оператор `not` | Инвертирует логическое значение. | `not a` |

## Ход выполнения работы

1. **Инициализация проекта**  
   - Создайте новый файл `lab3.py`.  
   - В начале файла импортируйте необходимые модули (если понадобится).  

2. **Условный оператор: пример «проверка числа»**  
   - Напишите программу, которая запрашивает у пользователя целое число и выводит, положительное ли оно, отрицательное или ноль.  
   ```python
   number = int(input("Введите целое число: "))
   if number > 0:
       print("Положительное")
   elif number == 0:
       print("Ноль")
   else:
       print("Отрицательное")
   ```

3. **Цикл `for`: генерация списка квадратов**  
   - Сгенерируйте список квадратов чисел от 1 до 10 и выведите его.  
   ```python
   squares = []
   for i in range(1, 11):
       squares.append(i ** 2)
   print("Квадраты:", squares)
   ```

4. **Цикл `while` с `break` и `continue`**  
   - Напишите программу, которая запрашивает числа от пользователя до тех пор, пока не будет введено число 0.  
   - Если введено отрицательное число, программа выводит предупреждение и пропускает его (используя `continue`).  
   - При вводе 0 цикл завершается (`break`).  
   ```python
   while True:
       val = int(input("Введите число (0 для завершения): "))
       if val == 0:
           print("Завершение цикла")
           break
       if val < 0:
           print("Отрицательное число, пропускаем")
           continue
       print("Введено:", val)
   ```

5. **Сложное условие**  
   - Создайте программу, которая определяет, является ли введенное число простым.  
   ```python
   n = int(input("Введите число для проверки простоты: "))
   if n <= 1:
       print("Не простое")
   else:
       is_prime = True
       for i in range(2, int(n ** 0.5) + 1):
           if n % i == 0:
               is_prime = False
               break
       print("Простое" if is_prime else "Не простое")
   ```

6. **Тестирование**  
   - Проведите тесты всех программ, убедившись в корректности работы условий и циклов.  
   - Запишите результаты (введенные значения и выводы) в отдельный файл `results.txt`.

## Контрольные вопросы / задания для самопроверки

1. Что произойдет, если условие в `if` всегда истинно, но нет блока `else`?  
2. В чем разница между `for` и `while`?  
3. Какой оператор используется для выхода из цикла изнутри?  
4. Как пропустить текущую итерацию цикла и перейти к следующей?  
5. Напишите условие, которое проверяет, что переменная `a` находится в диапазоне от 10 до 20 включительно.  
6. Как проверить, что число `x` является делителем числа `y`?  
7. Почему в проверке простоты числа цикл останавливается на `int(n ** 0.5) + 1`?  
8. Что делает оператор `not` в выражении `not (a > b)`?  
9. Приведите пример использования `elif` в реальной задаче.  
10. Как изменить программу из пункта 4, чтобы она возвращала список всех простых чисел до `n`?

## Отчёт по работе

Отчёт должен содержать:

1. **Титульный лист** – название работы, курс, имя студента, преподаватель, дата.  
2. **Введение** – цель лабораторной работы, ожидаемые результаты.  
3. **Теоретическая часть** – краткое изложение ключевых понятий (условные операторы, циклы, управляющие инструкции).  
4. **Методика выполнения** – описание шагов, порядок выполнения, использованные инструменты.  
5. **Результаты** – таблица/текст с примерами входных данных и выводов каждой программы, файл `results.txt`.  
6. **Анализ** – оценка корректности работы, возможные ошибки, способы их устранения.  
7. **Выводы** – основные навыки, освоенные в ходе работы, и их практическая ценность.  
8. **Приложения** – исходный код файлов `lab3.py`, `results.txt`.  

## Критерии оценки

1. **Корректность выполнения** – программы работают без ошибок и дают ожидаемый результат.  
2. **Полнота отчёта** – все разделы присутствуют и содержат необходимую информацию.  
3. **Качество кода** – читаемый, с комментариями, использованы понятные имена переменных.  
4. **Аналитика** – логический подход к анализу результатов и выводам.  
5. **Творческий подход** – добавление дополнительных функций (например, графика, работа с файлами) оценивается положительно.

## Рекомендуемая литература / источники

1. Гайдар, В. А. *Python. Основы программирования*. – Издательство МГТУ, 2021.  
2. Костюк, Н. К. *Программирование на Python*. – Издательство НИУ ВШЭ, 2022.  
3. Бойко, А. П. *Алгоритмы и структуры данных в Python*. – Издательство Наука, 2020.  
4. ГОСТ 34.101–2012. *Требования к программному обеспечению*.  
5. Левин, А. М. *Математический анализ для программистов*. – Издательство ВШЭ, 2019.

