---
tags:
  - Лабораторная_работа
Тема: 1.3 Массивы
Количество часов: 2
Номер занятия: 4
Состояние: Нужно усовершенствовать 
---

# Лабораторная работа № 4  
Разработка программ с использованием массивов  

## Цель и задачи  
1. Познакомиться с основными типами массивов в Python (списки, кортежи, массивы из модуля `array`).  
2. Научиться создавать, модифицировать и обрабатывать массивы.  
3. Освоить основные алгоритмы работы с массивами: поиск, сортировка, агрегирование.  
4. Разработать простую программу, демонстрирующую применение массивов в решении практической задачи.  

## Теоретическая часть  
1. **Массив** – структура данных, хранящая элементы одного типа в непрерывном участке памяти.  
2. **Список (`list`)** – динамический массив, допускающий элементы различных типов, поддерживает индексацию, срезы, методы `append`, `pop`, `sort`.  
3. **Кортеж (`tuple`)** – неизменяемый массив, элементы фиксируются после создания.  
4. **Модуль `array`** – предоставляет типизированные массивы, экономит память по сравнению со списками.  
5. **Индексация** – обращение к элементу по числовому индексу (`a[3]`).  
6. **Срезы** – подмассивы: `a[1:5]`, `a[:3]`, `a[3:]`.  
7. **Метод `append()`** – добавление элемента в конец списка.  
8. **Метод `extend()`** – добавление итерируемого объекта к списку.  
9. **Функция `sum()`** – подсчёт суммы элементов массива.  
10. **Алгоритм сортировки** – встроенный `list.sort()` (алгоритм Timsort, O(n log n)).  

## Ход выполнения работы  

1. **Инициализация массива**  
   ```python
   numbers = [12, 7, 25, 3, 18]
   ```  
   Пояснение: создаём список целых чисел.  

2. **Добавление элементов**  
   ```python
   numbers.append(9)          # Добавляем один элемент
   numbers.extend([4, 11])    # Добавляем несколько элементов
   ```  
   После выполнения `numbers` → `[12, 7, 25, 3, 18, 9, 4, 11]`.  

3. **Доступ к элементам и срезы**  
   ```python
   third = numbers[2]          # 25
   sub = numbers[1:4]          # [7, 25, 3]
   ```  

4. **Поиск минимального и максимального значения**  
   ```python
   min_val = min(numbers)      # 3
   max_val = max(numbers)      # 25
   ```  

5. **Сортировка массива**  
   ```python
   numbers.sort()              # numbers теперь [3, 4, 7, 9, 11, 12, 18, 25]
   ```  

6. **Агрегирование: подсчёт суммы и среднего**  
   ```python
   total = sum(numbers)        # 89
   average = total / len(numbers)  # 11.125
   ```  

7. **Создание массива из модуля `array`**  
   ```python
   import array
   arr = array.array('i', [12, 7, 25, 3, 18])
   ```  
   Пояснение: `'i'` – тип `int`.  

8. **Преобразование массива в список для удобства**  
   ```python
   lst_from_arr = list(arr)
   ```  

9. **Разработка практического задания**  
   Напишите программу, которая:  
   - Принимает с клавиатуры `n` чисел,  
   - Сохраняет их в список,  
   - Выводит минимальный, максимальный, сумму и среднее значение,  
   - Сортирует список и выводит отсортированные данные.  

   ```python
   n = int(input("Введите количество чисел: "))
   nums = []
   for i in range(n):
       val = int(input(f"Число {i+1}: "))
       nums.append(val)

   print("Минимум:", min(nums))
   print("Максимум:", max(nums))
   print("Сумма:", sum(nums))
   print("Среднее:", sum(nums)/len(nums))
   nums.sort()
   print("Отсортированный список:", nums)
   ```  

## Контрольные вопросы / задания для самопроверки  

1. Что такое массив и чем он отличается от списка?  
2. Какой тип данных используется в массиве модуля `array` и зачем он нужен?  
3. Как получить подмассив элементов с 3‑го по 6‑й?  
4. В чем преимущество метода `sort()` по сравнению с ручной сортировкой?  
5. Как найти сумму элементов в списке без использования функции `sum()`?  
6. Как изменить третий элемент списка `a` на значение `42`?  
7. Напишите код, который удалит последний элемент из списка без использования `pop()`.  
8. Что произойдёт, если попытаться изменить элемент кортежа?  
9. Как создать массив целых чисел из 10 элементов, заполненных нулями, используя `array`?  
10. Как вывести элементы списка в обратном порядке?  

## Отчёт по работе  
Структура отчёта:  

1. **Титульный лист** – название работы, номер, дата, имя студента.  
2. **Введение** – цель лабораторной, краткая характеристика темы.  
3. **Теоретическая часть** – изложение ключевых понятий, определений, формул.  
4. **Ход выполнения** – пошаговый разбор кода, пояснения, вставка фрагментов кода.  
5. **Результаты** – выводы программы, таблицы с данными, графики (если применимо).  
6. **Вывод** – обобщение полученных знаний, оценка эффективности подхода.  
7. **Список использованной литературы** – указание источников без ссылок.  

## Критерии оценки  

1. Корректность и полнота выполнения всех пунктов лабораторной.  
2. Чёткость и логичность изложенных объяснений.  
3. Правильность и читаемость кода (соблюдение стиля PEP 8).  
4. Полнота отчёта (структура, наличие всех разделов).  
5. Оригинальность решения (не копирование кода без комментариев).  

## Рекомендуемая литература / источники  

1. К. Б. Магарев. «Python. Программирование на языке» – учебник для колледжей.  
2. А. Л. Фёдоров. «Алгоритмы и структуры данных в Python» – практическое пособие.  
3. Официальная документация Python, раздел «Модули» и «Структуры данных».  
4. ГОСТ 2.105-95 «Профессиональная квалификация. Система образования. Колледж. Обучение программированию».  
5. М. Т. Харитонов. «Массивы и списки в Python: от простых списков до массивов модуля array».

