---
tags:
  - Обязательная_контрольная_работа
Тема: 1.10 Многопоточное программирование
Количество часов: 1
Номер занятия: 2
Состояние: Нужно усовершенствовать 
---

# Обязательная контрольная работа № 2

## Цель и задачи контрольной работы
1. Проверить знание основных понятий и принципов работы Python.  
2. Оценить умение применять синтаксис языка для решения практических задач.  
3. Развить навыки анализа и проектирования простых программных решений.

## Краткое теоретическое введение
- **Переменные и типы данных**: `int`, `float`, `str`, `bool`, `list`, `tuple`, `dict`, `set`.  
- **Условные конструкции**: `if`, `elif`, `else`.  
- **Циклы**: `for`, `while`, функции `range()`, `enumerate()`.  
- **Функции**: объявление `def`, аргументы, возвращаемые значения, область видимости.  
- **Модули и пакеты**: импорт `import`, `from ... import ...`.  
- **Обработка ошибок**: блоки `try`, `except`, `finally`.  
- **Файлы**: открытие `open()`, чтение, запись, контекстный менеджер `with`.  

## Условия выполнения
- Сдача в виде файла `task2.py` и текстового отчёта `report.md`.  
- Отчёт должен содержать ответы на теоретические вопросы и выводы из практических заданий.  
- Оформление: заголовки, нумерация пунктов, таблицы в формате Markdown.  
- Оценка производится по критериям, указанным в разделе «Критерии оценивания».  
- Срок сдачи: 5 дней с момента публикации работы.  

## Варианты заданий

### Вариант 1

1. **Теоретический вопрос** (2 балла)  
   Объясните разницу между списком (`list`) и кортежем (`tuple`).  
2. **Практическое задание** (5 баллов)  
   Напишите программу, которая принимает список чисел от пользователя и выводит сумму всех чётных элементов.  
3. **Задание на анализ** (3 балла)  
   Оцените эффективность использования цикла `for` по сравнению с функцией `sum()` для подсчёта суммы элементов списка.  
4. **Кодовое задание** (5 баллов)  
   Реализуйте функцию `is_prime(n)` без использования сторонних библиотек, которая возвращает `True`, если `n` — простое число, иначе `False`.  

### Вариант 2

1. **Теоретический вопрос** (2 балла)  
   Что такое исключение в Python и как его обрабатывать?  
2. **Практическое задание** (5 баллов)  
   Создайте программу, которая читает файл `data.txt`, считает количество строк и выводит их в обратном порядке.  
3. **Задание на проектирование** (4 балла)  
   Спроектируйте структуру модуля, содержащего функции для работы с CSV-файлами: чтение, запись, фильтрация строк.  
4. **Кодовое задание** (5 баллов)  
   Напишите декоратор `timing`, который выводит время выполнения обёрнутой функции.  

### Вариант 3

1. **Теоретический вопрос** (2 балла)  
   Опишите назначение функции `range()` в цикле `for`.  
2. **Практическое задание** (5 баллов)  
   Напишите программу, которая генерирует список из 10 случайных целых чисел в диапазоне 1–100 и сортирует его по возрастанию.  
3. **Задание на анализ** (3 балла)  
   Сравните производительность сортировки `list.sort()` и `sorted()`.  
4. **Кодовое задание** (5 баллов)  
   Реализуйте простую командную строку калькулятора, поддерживающую операции сложения, вычитания, умножения и деления.  

## Критерии оценивания
| Показатель | Баллы |
|------------|-------|
| Правильность выполнения практических заданий | 10 |
| Теоретические ответы | 6 |
| Оформление отчёта | 3 |
| Чистота и читаемость кода | 3 |
| **Итого** | **22** |

## Рекомендации для студента
- Тщательно разберите материал лекций и конспектов по темам, указанным в введении.  
- Практикуйтесь в написании кода в отдельном файле `task2.py`, чтобы убедиться в его корректности.  
- Для теоретических вопросов используйте собственные слова, избегайте прямого копирования текста.  
- Проверьте программу на наличие ошибок и протестируйте её на разных входных данных.

## Пример решения (задание 2.4)

**Код** (`task2.py`):

```python
import time

def timing(func):
    """Декоратор для измерения времени работы функции."""
    def wrapper(*args, **kwargs):
        start = time.time()
        result = func(*args, **kwargs)
        end = time.time()
        print(f"Время выполнения: {end - start:.6f} с")
        return result
    return wrapper

@timing
def add(a, b):
    return a + b

if __name__ == "__main__":
    print(add(5, 7))
```

**Пояснение**  
1. Функция `timing` принимает другую функцию `func` и возвращает обёртку `wrapper`.  
2. В `wrapper` запоминаем время начала, вызываем исходную функцию, запоминаем время окончания, выводим разницу.  
3. Декоратор применён к функции `add`, поэтому при её вызове автоматически выводится время выполнения.  

## Время на выполнение
1 час

## Выводы
Контрольная работа проверяет фундаментальные знания синтаксиса Python, умение писать корректный и эффективный код, а также навыки анализа и проектирования небольших программных модулей.

