---
tags:
  - Обязательная_контрольная_работа
Тема: 1.11 Система ввода-вывода
Количество часов: 1
Номер занятия: 1
Состояние: Нужно усовершенствовать 
---

# Обязательная контрольная работа № 1

## Цель и задачи контрольной работы
1. Проверить знание основных понятий и методов работы с Python.  
2. Оценить умение писать простые программы и отлаживать код.  
3. Развить навыки анализа и проектирования небольших задач.

## Краткое теоретическое введение
- **Переменные и типы данных**: int, float, str, bool, list, dict, tuple, set.  
- **Операторы**: арифметические (+, -, *, /, //, %), логические (and, or, not), сравнения (==, !=, >, <, >=, <=).  
- **Условные конструкции**: if, elif, else.  
- **Циклы**: for, while.  
- **Функции**: def, return, аргументы, *args, **kwargs.  
- **Модули и пакеты**: import, from … import.  
- **Обработка ошибок**: try, except, finally.  

## Условия выполнения
- Сдача в виде текстового файла `.py` или `.md` с комментариями.  
- Включить в файл заголовок с именем студента и номером группы.  
- Код должен быть без синтаксических ошибок и работать в Python 3.11.  
- Максимальное количество строк кода: 200.  
- Оценка: 30 баллов.  

## Варианты заданий

### Вариант 1
1. **Теоретический вопрос (5 б)**  
   Объясните разницу между списком и кортежем в Python.  
2. **Практическое задание (10 б)**  
   Напишите функцию `sum_even(nums)` возвращающую сумму чётных чисел из списка `nums`.  
3. **Анализ (5 б)**  
   Оцените, какие структуры данных лучше использовать для хранения уникальных элементов в коллекции.  
4. **Кодовое задание (10 б)**  
   Реализуйте программу, которая читает файл `numbers.txt` и выводит среднее арифметическое чисел.  
5. **Форматирование (5 б)**  
   Комментируйте каждую строку кода.

### Вариант 2
1. **Теоретический вопрос (5 б)**  
   Что такое декоратор в Python и как он работает?  
2. **Практическое задание (10 б)**  
   Создайте функцию `fibonacci(n)` возвращающую список первых `n` чисел Фибоначчи.  
3. **Анализ (5 б)**  
   Опишите преимущества использования генераторов по сравнению с обычными циклами.  
4. **Кодовое задание (10 б)**  
   Напишите скрипт, который принимает от пользователя строку и выводит её в обратном порядке без использования slicing.  
5. **Форматирование (5 б)**  
   Используйте PEP 8 для названий переменных и функций.

### Вариант 3
1. **Теоретический вопрос (5 б)**  
   Как реализуется наследование в Python?  
2. **Практическое задание (10 б)**  
   Создайте класс `BankAccount` с методами `deposit`, `withdraw` и атрибутом `balance`.  
3. **Анализ (5 б)**  
   Объясните, какие исключения могут возникнуть при работе с файлами и как их обрабатывать.  
4. **Кодовое задание (10 б)**  
   Напишите программу, которая генерирует случайное число от 1 до 100 и позволяет пользователю угадывать его, выводя подсказки «больше»/«меньше».  
5. **Форматирование (5 б)**  
   Включите docstring для каждого класса/функции.

## Критерии оценивания
- **Теоретическое знание** – 15 б  
- **Кодирование** – 15 б  
  - Корректность выполнения – 10 б  
  - Чистота кода и комментарии – 5 б  
- **Форматирование и оформление** – 5 б  
- **Соблюдение сроков и требований** – 5 б  

## Рекомендации для студента
1. Перечитайте главы «Переменные и типы данных» и «Функции» в учебнике.  
2. Практикуйтесь в написании небольших скриптов до выполнения контрольной.  
3. Проверяйте код на наличие синтаксических ошибок перед сдачей.  
4. Используйте комментарии, чтобы пояснить логику каждой части программы.

## Пример решения (задание 2 варианта, пункт 2)
```python
def fibonacci(n):
    """Возвращает список первых n чисел Фибоначчи."""
    if n <= 0:
        return []
    seq = [0, 1]
    while len(seq) < n:
        seq.append(seq[-1] + seq[-2])
    return seq[:n]

# Пример использования
print(fibonacci(10))  # [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
```
*Пояснение*:  
- Проверяем, что `n` положительное.  
- Начинаем список с `[0, 1]`.  
- В цикле добавляем сумму двух последних элементов.  
- Возвращаем только нужное число элементов.

## Время на выполнение
1 час

## Выводы
Студенты проверяют знания фундаментальных понятий Python, умение писать и анализировать код, а также соблюдение требований к оформлению и структуре программ.

